""" 01 Торговый автомат

Напишите программу, которая
- моделирует работу торгового автомата.

Автомат принимает только монеты номиналом 1, 2, 5, 10 и 50.
Программа должна запрашивать у пользователя общую стоимость покупки,
а затем отображать сколько монет каждого типа нужно потратить,
чтобы использовать минимальное количество монет для оплаты товара.


Пример вывода:
Введите стоимость товара: 127
Внесите монеты номиналом 50: 2
Внесите монеты номиналом 10: 2
Внесите монеты номиналом 5: 1
Внесите монеты номиналом 2: 1
"""
# ввод суммы
# amount = int(input("Введите стоимость товара: "))
amount = 127
# список монет
coins = [50, 10, 5, 2, 1]

# проходим по каждой монете
for coin in coins:

    # сколько таких монет нужно
    count = amount // coin

    # если есть хотя бы одна монета
    if count > 0:
        print("Внесите монеты номиналом", coin, ":", count)

        # уменьшаем сумму
        amount = amount % coin